# Indexing, Selection and Filtering

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [2]:
frame = DataFrame(np.arange(16).reshape(4, 4), 
                  index=['India', 'China', 'USA', 'Russia'], 
                  columns=['one', 'two', 'three', 'four'])
frame

        one  two  three  four
India     0    1      2     3
China     4    5      6     7
USA       8    9     10    11
Russia   12   13     14    15

## Indexing

In [6]:
# Indexing
frame['four']

India      3
China      7
USA       11
Russia    15
Name: four, dtype: int64

In [13]:
frame[['three', 'four']]

        three  four
India       2     3
China       6     7
USA        10    11
Russia     14    15

## Slicing
In Slicing with labels the endpoint is inclusive.

In [23]:
# Slicing
frame[1:2]

       one  two  three  four
China    4    5      6     7

In [21]:
frame[frame['three'] > 5]

        one  two  three  four
China     4    5      6     7
USA       8    9     10    11
Russia   12   13     14    15

In [22]:
frame > 5

          one    two  three   four
India   False  False  False  False
China   False  False   True   True
USA      True   True   True   True
Russia   True   True   True   True